package check

func Check(imt float64) string {
	msg := ""

	if imt < 16.0 {
		msg = "Выраженный дефицит массы тела"
	}

	if imt > 16.0 && imt < 18.5 {
		msg = "Недостаточная масса тела (дефицит)"
	}

	if imt > 18.5 && imt < 24.9 {
		msg = "Нормальный вес"
	}

	if imt > 25.0 && imt < 29.9 {
		msg = "Избыточная масса тела (предожирение)"
	}

	if imt > 30.0 && imt < 34.9 {
		msg = "Ожирение 1-й степени"
	}

	if imt > 35.0 && imt < 39.9 {
		msg = "Ожирение 2-й степени"
	}

	if imt >= 40.0 {
		msg = "Ожирение 3-й степени (морбидное)"
	}

	return msg
}
